Insert

In [4]:
import pandas as pd

var = pd.DataFrame({"a":[1,2,3,4,5],"b":[5,6,7,8,9]})
var

   a  b
0  1  5
1  2  6
2  3  7
3  4  8
4  5  9

In [5]:
var.insert(1,"c",var["a"])
var

   a  c  b
0  1  1  5
1  2  2  6
2  3  3  7
3  4  4  8
4  5  5  9

In [7]:
var.insert(1,"d",[11,1,21,67,87])
var

   a   d  c  b
0  1  11  1  5
1  2   1  2  6
2  3  21  3  7
3  4  67  4  8
4  5  87  5  9

In [9]:
var1 = pd.DataFrame({"x":[1,4,10,9,6], "y":[2,5,7,13,12]})
var1

    x   y
0   1   2
1   4   5
2  10   7
3   9  13
4   6  12

In [11]:
var1["z"]= var1["x"][:2]
var1

    x   y    z
0   1   2  1.0
1   4   5  4.0
2  10   7  NaN
3   9  13  NaN
4   6  12  NaN

DELETE

In [12]:
var1.pop("z")
var1

    x   y
0   1   2
1   4   5
2  10   7
3   9  13
4   6  12

In [13]:
del var1["x"]
var1

    y
0   2
1   5
2   7
3  13
4  12